In [1]:
import numpy as np
import pandas as pd

In [10]:
data = [range(10)]
data

[range(0, 10)]

In [16]:
my_columns = range(1,11) #range = list 
my_index = ["score"]
df = pd.DataFrame(data,index=my_index,columns=my_columns)

df

       1   2   3   4   5   6   7   8   9   10
score   0   1   2   3   4   5   6   7   8   9

In [17]:
df.describe()

        1    2    3    4    5    6    7    8    9    10
count  1.0  1.0  1.0  1.0  1.0  1.0  1.0  1.0  1.0  1.0
mean   0.0  1.0  2.0  3.0  4.0  5.0  6.0  7.0  8.0  9.0
std    NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
min    0.0  1.0  2.0  3.0  4.0  5.0  6.0  7.0  8.0  9.0
25%    0.0  1.0  2.0  3.0  4.0  5.0  6.0  7.0  8.0  9.0
50%    0.0  1.0  2.0  3.0  4.0  5.0  6.0  7.0  8.0  9.0
75%    0.0  1.0  2.0  3.0  4.0  5.0  6.0  7.0  8.0  9.0
max    0.0  1.0  2.0  3.0  4.0  5.0  6.0  7.0  8.0  9.0

In [18]:
data2 = {"A_coin":range(15,32)}
data2

{'A_coin': range(15, 32)}

In [21]:
df2 = pd.DataFrame(data2)
df2

    A_coin
0       15
1       16
2       17
3       18
4       19
5       20
6       21
7       22
8       23
9       24
10      25
11      26
12      27
13      28
14      29
15      30
16      31

In [23]:
data3 = {"A_coin":[10.2,10.4,10.9,10.3],
         "date":[19990801,19990802,19990803,19990804]}
data3

{'A_coin': [10.2, 10.4, 10.9, 10.3],
 'date': [19990801, 19990802, 19990803, 19990804]}

In [25]:
df3 = pd.DataFrame(data3)
df3

   A_coin      date
0    10.2  19990801
1    10.4  19990802
2    10.9  19990803
3    10.3  19990804

In [26]:
df3['BTCUSDT'] = [29999,30123,30121,28998]
df3

   A_coin      date  BTCUSDT
0    10.2  19990801    29999
1    10.4  19990802    30123
2    10.9  19990803    30121
3    10.3  19990804    28998

In [27]:
df3.set_index('date')

          A_coin  BTCUSDT
date
19990801    10.2    29999
19990802    10.4    30123
19990803    10.9    30121
19990804    10.3    28998

In [28]:
df3['date']

0    19990801
1    19990802
2    19990803
3    19990804
Name: date, dtype: int64

In [29]:
df3.date

0    19990801
1    19990802
2    19990803
3    19990804
Name: date, dtype: int64

In [30]:
df3.date[2]

19990803

In [35]:
df3

          A_coin  BTCUSDT
date
19990801    10.2    29999
19990802    10.4    30123
19990803    10.9    30121
19990804    10.3    28998

In [37]:
df3 = df3.set_index('date')

KeyError: "None of ['date'] are in the columns"

In [38]:
df3

          A_coin  BTCUSDT
date
19990801    10.2    29999
19990802    10.4    30123
19990803    10.9    30121
19990804    10.3    28998

In [49]:
df3.reset_index()

       date  A_coin  BTCUSDT
0  19990801    10.2    29999
1  19990802    10.4    30123
2  19990803    10.9    30121
3  19990804    10.3    28998

In [50]:
df3

          A_coin  BTCUSDT
date
19990801    10.2    29999
19990802    10.4    30123
19990803    10.9    30121
19990804    10.3    28998

In [45]:
df3.set_index('date',inplace=False)

KeyError: "None of ['date'] are in the columns"

In [51]:
df3.reset_index()

       date  A_coin  BTCUSDT
0  19990801    10.2    29999
1  19990802    10.4    30123
2  19990803    10.9    30121
3  19990804    10.3    28998

In [52]:
df3

          A_coin  BTCUSDT
date
19990801    10.2    29999
19990802    10.4    30123
19990803    10.9    30121
19990804    10.3    28998

In [53]:
df3.reset_index(inplace=True)
df3

       date  A_coin  BTCUSDT
0  19990801    10.2    29999
1  19990802    10.4    30123
2  19990803    10.9    30121
3  19990804    10.3    28998

In [54]:
df3.columns

Index(['date', 'A_coin', 'BTCUSDT'], dtype='object')

In [55]:
df3.columns = ['a','b','c']

In [56]:
df3

          a     b      c
0  19990801  10.2  29999
1  19990802  10.4  30123
2  19990803  10.9  30121
3  19990804  10.3  28998

In [58]:
df3.rename({'c':'BTCUSDT'})
df3

          a     b      c
0  19990801  10.2  29999
1  19990802  10.4  30123
2  19990803  10.9  30121
3  19990804  10.3  28998

In [60]:
df3.rename({'c':'BTCUSDT'},inplace=True)
df3

          a     b      c
0  19990801  10.2  29999
1  19990802  10.4  30123
2  19990803  10.9  30121
3  19990804  10.3  28998

In [62]:
df3.rename(columns={'c':'BTCUSDT'},inplace=True)
df3

          a     b  BTCUSDT
0  19990801  10.2    29999
1  19990802  10.4    30123
2  19990803  10.9    30121
3  19990804  10.3    28998

In [63]:
df3.rename(index={0:'index1'},inplace=True)
df3

               a     b  BTCUSDT
index1  19990801  10.2    29999
1       19990802  10.4    30123
2       19990803  10.9    30121
3       19990804  10.3    28998

In [3]:
data = {'Country':['Belgium','India','Brazil'],
        'Capital':['Brussels','New Delhi','Brasilia'],
        'Population':[11190846,1303171035,207847520]}

data

{'Country': ['Belgium', 'India', 'Brazil'],
 'Capital': ['Brussels', 'New Delhi', 'Brasilia'],
 'Population': [11190846, 1303171035, 207847520]}

In [4]:
df = pd.DataFrame(data)
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847520

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Country     3 non-null      object
 1   Capital     3 non-null      object
 2   Population  3 non-null      int64
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [6]:
df.describe()

         Population
count  3.000000e+00
mean   5.074031e+08
std    6.961346e+08
min    1.119085e+07
25%    1.095192e+08
50%    2.078475e+08
75%    7.555093e+08
max    1.303171e+09

In [8]:
df.sum()

Country              BelgiumIndiaBrazil
Capital       BrusselsNew DelhiBrasilia
Population                   1522209401
dtype: object

In [9]:
df['Country']

0    Belgium
1      India
2     Brazil
Name: Country, dtype: object

In [12]:
df[df['Population']>1200000000]

  Country    Capital  Population
1   India  New Delhi  1303171035

In [13]:
g = df.drop('Country',axis='columns')
g

     Capital  Population
0   Brussels    11190846
1  New Delhi  1303171035
2   Brasilia   207847520